//
//
// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
//     let qqqq = [4, 7, 8, 9];
// let numMin=(array)=>{
//     let min =array[0];
//     for (const key of array) {
//             if (min>key){
//                 min = key;
//             }
//         }
//     return min
// }
//
// console.log(numMin(qqqq));




// // - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
//
// let number = [1, 5, 3, 9, 0, -21];
// let numMaw=(array)=>{
//     let max = array[0];
//     for (const arrayElement of array) {
//         if (max<arrayElement){
//             max = arrayElement;
//        }
//     }
//     console.log(numMaw(number));
//     return max
// }

// - створити функцію яка повертає найбільше число з масиву


// - створити функцію яка повертає найменьше число з масиву
// // - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// let number = [1, 2, 3, 5, 4, 8, 5, 7];
// let sumNam = (array) => {
//     let sum = 0;
//     for (let i = 0; i < array.length; i++) {
//         sum += array[i];
//     }
//     return sum
// }
// console.log(sumNam(number));

// - Дано натуральное число n. Выведите все числа от 1 до n.


let mum=(array)=>{
    let num
    for (let i=0; i<10;i++) {
        if (1 < array && array < 10) {
            num = array;
        }
    }
        return num
}
console.log(mum(i));

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
